app/controllers/mains_controller.rb

SELECT `mains`.* FROM `mains`
---
  def index
    @mains = Main.all