app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
---
  def show
    @post = Post.find(params[:id])

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
---
  def edit
    @post = Post.find(params[:id])

INSERT INTO `posts` (`name`, `title`, `content`, `created_at`, `updated_at`, `avatar_file_name`, `avatar_content_type`, `avatar_file_size`, `avatar_updated_at`) VALUES (NULL, NULL, NULL, '2012-09-13 11:05:07', '2012-09-13 11:05:07', NULL, NULL, NULL, NULL)
---
  def create
    @post = Post.create( params[:post] )

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `avatar_file_name` = 'skill_icon.png', `avatar_content_type` = 'image/png', `avatar_file_size` = 17643, `avatar_updated_at` = '2012-09-13 11:51:00', `name` = 'rails ', `title` = 'ruby', `content` = 'ruby on rails skillset', `updated_at` = '2012-09-13 11:51:01' WHERE `posts`.`id` = 5
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])